{
  "_name_or_path": "allenai/OLMo-1B",
  "activation_type": "swiglu",
  "alibi": false,
  "alibi_bias_max": 8.0,
  "architectures": [
    "OLMoForCausalLM"
  ],
  "attention_dropout": 0.0,
  "attention_layer_norm": false,
  "attention_layer_norm_with_affine": false,
  "auto_map": {
    "AutoConfig": "allenai/OLMo-1B--configuration_olmo.OLMoConfig",
    "AutoModelForCausalLM": "allenai/OLMo-1B--modeling_olmo.OLMoForCausalLM",
    "AutoTokenizer": [
      "allenai/OLMo-1B--tokenization_olmo_fast.OLMoTokenizerFast",
      "allenai/OLMo-1B--tokenization_olmo_fast.OLMoTokenizerFast"
    ]
  },
  "bias_for_layer_norm": false,
  "block_group_size": 1,
  "block_type": "sequential",
  "clip_qkv": null,
  "d_model": 2048,
  "embedding_dropout": 0.0,
  "embedding_size": 50304,
  "eos_token_id": 50279,
  "flash_attention": false,
  "include_bias": false,
  "init_cutoff_factor": null,
  "init_device": "meta",
  "init_fn": "mitchell",
  "init_std": 0.02,
  "layer_norm_type": "default",
  "layer_norm_with_affine": false,
  "max_sequence_length": 2048,
  "mlp_hidden_size": null,
  "mlp_ratio": 8,
  "model_type": "olmo",
  "multi_query_attention": false,
  "n_heads": 16,
  "n_layers": 16,
  "pad_token_id": 1,
  "precision": "amp_bf16",
  "quantization_config": {
    "bnb_4bit_compute_dtype": "float16",
    "bnb_4bit_quant_type": "nf4",
    "bnb_4bit_use_double_quant": false,
    "llm_int8_enable_fp32_cpu_offload": false,
    "llm_int8_has_fp16_weight": false,
    "llm_int8_skip_modules": null,
    "llm_int8_threshold": 6.0,
    "load_in_4bit": true,
    "load_in_8bit": false,
    "quant_method": "bitsandbytes"
  },
  "residual_dropout": 0.0,
  "rope": true,
  "rope_full_precision": true,
  "scale_logits": false,
  "transformers_version": "4.36.2",
  "use_cache": false,
  "vocab_size": 50280,
  "weight_tying": true
}
