{
  "activation_type": "swiglu",
  "alibi": false,
  "alibi_bias_max": 8.0,
  "architectures": [
    "OLMoForCausalLM"
  ],
  "attention_dropout": 0.0,
  "attention_layer_norm": false,
  "attention_layer_norm_with_affine": false,
  "auto_map": {
    "AutoConfig": "allenai/OLMo-1B--configuration_olmo.OLMoConfig",
    "AutoModelForCausalLM": "allenai/OLMo-1B--modeling_olmo.OLMoForCausalLM",
    "AutoTokenizer": [
      "allenai/OLMo-1B--tokenization_olmo_fast.OLMoTokenizerFast",
      "allenai/OLMo-1B--tokenization_olmo_fast.OLMoTokenizerFast"
    ]
  },
  "bias_for_layer_norm": false,
  "block_group_size": 1,
  "block_type": "sequential",
  "clip_qkv": null,
  "d_model": 2048,
  "emb_init_std": null,
  "embedding_dropout": 0.0,
  "embedding_layer_norm": false,
  "embedding_size": 50304,
  "eos_token_id": 50279,
  "flash_attention": false,
  "include_bias": false,
  "init_cutoff_factor": null,
  "init_device": "meta",
  "init_fn": "mitchell",
  "init_std": 0.02,
  "layer_norm_eps": 1e-05,
  "layer_norm_type": "default",
  "layer_norm_with_affine": false,
  "max_sequence_length": 2048,
  "mlp_hidden_size": null,
  "mlp_ratio": 8,
  "model_type": "hf_olmo",
  "multi_query_attention": false,
  "n_heads": 16,
  "n_kv_heads": null,
  "n_layers": 16,
  "norm_after": false,
  "pad_token_id": 1,
  "precision": "amp_bf16",
  "residual_dropout": 0.0,
  "rope": true,
  "rope_full_precision": true,
  "rope_theta": 10000,
  "scale_emb_init": false,
  "scale_logits": false,
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "use_cache": true,
  "vocab_size": 50280,
  "weight_tying": true
}
